// 比如问我commonjs和esmoudle的区别
// 变量提升的原理
// 作用域链是什么
// substr和substring的区别
// vite为什么比webpack快
// pina
// setup相关问题
// 高性能的表格
// cdn
// new Vue的时候发生了什么
// vue拓展插件
// LRU缓存策略 - keep-alive原理
// 函数式编程
// 前端组件库的建设标准
// 如何设计二叉树
// 多年前端以来有什么积累
// 项目有哪些，有什么亮点
// 因为前面说了动画，所以再继续问后续有什么关注，有好用的插件之类
// 项目中遇到过的难点
// 给出了个题目: nfc刷卡登录刷卡退出 要能自动呈现给客户怎么做
// ?. ??

// 设计模式，熟悉哪些 在工作中运用哪些
// 单例模式如何封装成公用类class，提取出来 再用于任何需要单例模式的类

// vue响应式原理
// nextick原理，和如果让你去实现 如何实现
// 什么是函数式编程
// 闭包用于哪些(私密属性，防抖 节流)
// 如何实现一个防抖
// 如何理解宏任务和微任务，浏览器渲染页面是在哪个阶段( 宏还是微）
